ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/UC1_I2CT_1.0.xml
    <register id="UC1_I2CT_GFCTL" width="32" offset="0x1118" description="I2C Glitch Filter Control">
        <bitfield id="AGFEN" description="Analog Glitch Suppression Enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Analog Glitch Filter disable"/>
            <bitenum id="ENABLE" value="0x1" description="Analog Glitch Filter enable"/>
        </bitfield>
    </register>
    <register id="UC1_I2CT_TTXDATA" width="32" offset="0x1120" description="I2C TXData">
        <bitfield id="DATA" description="Transmit Data
This byte contains the data to be transferred during the next transaction." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC1_I2CT_RXDATA" width="32" offset="0x1124" description="I2C RXData">
        <bitfield id="DATA" description="Received Data. 
This field contains the last received data." begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC1_I2CT_PECSR" width="32" offset="0x1128" description="PEC status register">
        <bitfield id="PECBYTECNT" description="This is the current PEC Byte Count of the State Machine." begin="8" end="0" width="9" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
            <bitenum id="MAXIMUM" value="0x1FF" description="Maximum Value"/>
        </bitfield>
        <bitfield id="PECSTS_CHECK" description="This status bit indicates if the PEC was checked in the transaction that occurred before the last Stop. Latched on Stop." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="CLEARED" value="0x0" description="Indicates PEC was not checked in the transaction that occurred before the last Stop"/>
            <bitenum id="SET" value="0x1" description="Indicates PEC was checked in the transaction that occurred before the last Stop"/>
        </bitfield>
        <bitfield id="PECSTS_ERROR" description="This status bit indicates if a PEC check error occurred in the transaction that occurred before the last Stop. Latched on Stop." begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="CLEARED" value="0x0" description="Indicates PEC check error did not occurr in the transaction that occurred before the last Stop"/>
            <bitenum id="SET" value="0x1" description="Indicates PEC check error occurred in the transaction that occurred before the last Stop"/>
        </bitfield>
    </register>
    <register id="UC1_I2CT_OAR2" width="32" offset="0x1148" description="Own Address 2">
        <bitfield id="OAR2" description="Own Address 2This field specifies the alternate OAR2 address." begin="6" end="0" width="7" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x7F" description="Highest possible value"/>
        </bitfield>
        <bitfield id="OAR2EN" description="Own Address 2 Enable" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The alternate address is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="Enables the use of the alternate address in the OAR2 field."/>
        </bitfield>
        <bitfield id="OAR2_MASK" description="Own Address 2 Mask: This field specifies bits A6 through A0 of the Target address.
The bits with value 1 in SOAR2.OAR2_MASK field will make the corresponding incoming address bits to match by default regardless of the value inside SOAR2.OAR2 i.e. corresponding SOAR2.OAR2 bit is a dont care." begin="22" end="16" width="7" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
            <bitenum id="MAXIMUM" value="0x7F" description="Maximum Value"/>
        </bitfield>
    </register>
    <register id="UC1_I2CT_OAR" width="32" offset="0x114C" description="I2C Own Address">
        <bitfield id="OAR" description="Own Address: This field specifies bits A9 through A0 of the Target address.
In 7-bit addressing mode as selected by I2CSOAR.MODE bit, the top 3 bits are don't care" begin="9" end="0" width="10" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3FF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="OAREN" description="Own Address Enable" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable OAR address"/>
            <bitenum id="ENABLE" value="0x1" description="Enable OAR address"/>
        </bitfield>
        <bitfield id="MODE" description="This bit selects the adressing mode to be used.
When 0, 7-bit addressing is used.
When 1, 10-bit addressing is used." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="MODE7" value="0x0" description="Enable 7-bit addressing"/>
            <bitenum id="MODE10" value="0x1" description="Enable 10-bit addressing"/>
        </bitfield>
    </register>
    <register id="UC1_I2CT_TIMEOUT_CNT" width="32" offset="0x1150" description="I2C Timeout Count Register">
        <bitfield id="TCNTA" description="Timeout Count A Current Count: This field contains the upper 8 bits of a 12-bit current counter for timeout counter A" begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest Value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="TCNTB" description="Timeout Count B Current Count: This field contains the upper 8 bits of a 12-bit current counter for timeout counter B" begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest Value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC1_I2CT_TIMEOUT_CTL" width="32" offset="0x1154" description="I2C Timeout Count Control Register">
        <bitfield id="TCNTLA" description="Timeout counter A load value
Counter A is used for SCL low detection. This field contains the upper 8 bits of a 12-bit pre-load value for the Timeout A count. NOTE: The value of CNTLA must be greater than 1h. 
Each count is equal to 520 times the timeout period of functional clock. For example, with 8MHz functional clock and a 100KHz operating I2C clock, one timeout period will be equal to (1 / 8MHz) * 520 or 65 us." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest Value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="TCNTAEN" description="Timeout Counter A Enable" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Timeout Counter B"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Timeout Counter B"/>
        </bitfield>
        <bitfield id="TCNTLB" description="Timeout Count B Load: Counter B is used for SCL High Detection. This field contains the upper 8 bits of a 12-bit pre-load value for the Timeout B count. NOTE: The value of CNTLB must be greater than 1h. 
Each count is equal to 1* clock period. For example, with 10MHz functional clock one timeout period will be equal to1*100ns." begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="TCNTBEN" description="Timeout Counter B Enable" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Timeout Counter B"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Timeout Counter B"/>
        </bitfield>
    </register>
    <register id="UC1_I2CT_PECCTL" width="32" offset="0x1158" description="I2C PEC control register">
        <bitfield id="PECCNT" description="When this field is non zero, the number of I2C data bytes are counted. When the byte count = PECCNT and the state machine is transmitting, the contents of the LSFR is loaded into the shift register instead of the byte received from the Tx FIFO. When the state machine is receiving, after the last bit of this byte is received the LSFR is checked and if it is non-zero, a PEC RX Error interrupt is generated. The I2C packet must be padded to include the PEC byte for both transmit and receive. In transmit mode the FIFO must be loaded with a dummy PEC byte. In receive mode the PEC byte will be passed to the Rx FIFO.
In the normal use case, FW would set PECEN=1 and PECCNT=0 and use the ACKOEN until the remaining SMB packet length is known. FW would then set the PECCNT to the remaining packet length (Including PEC bye). FW would then configure DMA to allow the packet to complete unassisted and exit NoAck mode.
Note that when the byte count = PEC CNT, the byte count is reset to 0 and multiple PEC calculation can automatically occur within a single I2C transaction" begin="8" end="0" width="9" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
            <bitenum id="MAXIMUM" value="0x1FF" description="Maximum Value"/>
        </bitfield>
        <bitfield id="PECEN" description="PEC Enable
This bit enables the SMB Packet Error Checking (PEC). When enabled the PEC is calculated on all bits except the Start, Stop, Ack and Nack. The PEC LSFR and the Byte Counter is set to 0 when the State Machine is in the IDLE state, which occur following a Stop or when a timeout occurs. The Counter is also set to 0 after the PEC byte is sent or received. Note that the NACK is automatically send following a PEC byte that results in a PEC error.
The PEC Polynomial is x^8 + x^2 + x^1 + 1." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="PEC transmission and check is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="PEC transmission and check is enabled"/>
        </bitfield>
    </register>

</module>